tutorials/order/hydrostatic/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }
application ibmPimpleFoam; startFrom startTime; startTime 0; stopAt endTime; endTime 10; deltaT 0.01;
writeControl runTime; writeInterval 10; purgeWrite 0; writeFormat ascii; writePrecision 12;
timeFormat general; timePrecision 6; runTimeModifiable true; adjustTimeStep no;
